Конфигурация/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Сотрудники/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(Пользователь) И ЮрФизЛицо <> Пользователь.ЮрФизЛицо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Физическое лицо (%1) сотрудника (%2)  не совпадает с физическим лицом (%3) пользователя (%4)",
				ЮрФизЛицо,
				Наименование,
				Пользователь.ЮрФизЛицо,
				Пользователь), ЭтотОбъект,,, Отказ);
	КонецЕсли;	
		
	Если НЕ ЭтоНовый()
	   И Пользователь <> Ссылка.Пользователь 
	   И Справочники.Сотрудники.СотрудникИспользуетсяВМеханизмеОтветственныхЗаОперации(Ссылка) Тогда		
	   
	   	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Сотрудник (%1) используется в механизме ответственных за операции. Нельзя менять пользователя. Текущий пользователь '%2', новый пользователь '%3'", 
				Наименование,
				Ссылка.Пользователь,
				Пользователь), ЭтотОбъект,,, Отказ);
	КонецЕсли;	
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	КонецЕсли;
		
КонецПроцедуры
